### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [124]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
# file_to_load ="purch"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv('04-Pandas_Pandas_HW_Instructions_HeroesOfPymoli_Resources_purchase_data.csv')

In [4]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [10]:
total_players = len(purchase_data['SN'].unique())

print(total_players)

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [16]:
unique_items = len(purchase_data['Item ID'].unique())
average_price = purchase_data['Price'].mean()
num_purchases = purchase_data.shape[0]
total_revenue = purchase_data['Price'].sum()

display_dict = [{'Number of Unique Items' : unique_items,
                'Average Price' : average_price, 
                'Number of Purchases' : num_purchases,
                'Total Revenue' : total_revenue}]

display_frame = pd.DataFrame(display_dict)

display_frame.head(1)

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     183       3.050987                  780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [23]:
genders = purchase_data[['Gender', 'SN']].drop_duplicates()

genders = genders['Gender'].value_counts().reset_index()
genders['total'] = total_players

genders['ratio'] = genders['Gender'] / genders['total']

print(genders)

                   index  Gender  total     ratio
0                   Male     484    576  0.840278
1                 Female      81    576  0.140625
2  Other / Non-Disclosed      11    576  0.019097

In [24]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [27]:
purchase_data.groupby('Gender').agg({'Price':['sum', 'mean','count']}).reset_index()

                  Gender    Price
                              sum      mean count
0                 Female   361.94  3.203009   113
1                   Male  1967.64  3.017853   652
2  Other / Non-Disclosed    50.19  3.346000    15

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [62]:
player_data = purchase_data[['Age', 'SN']].drop_duplicates()


player_data['range'] = pd.cut(player_data.Age, [0,9,14,19,24,29,34,39], include_lowest=False)
player_counts = player_data['range'].value_counts().reset_index()

player_counts['Percentage of Players'] = player_counts['range'] / total_players
player_counts.columns = ['bin', 'Total Count', 'Percentage of Players']

player_counts.head(10)

        bin  Total Count  Percentage of Players
0  (19, 24]          258               0.447917
1  (14, 19]          107               0.185764
2  (24, 29]           77               0.133681
3  (29, 34]           52               0.090278
4  (34, 39]           31               0.053819
5   (9, 14]           22               0.038194
6    (0, 9]           17               0.029514

In [63]:
purchase_data[purchase_data['Age'] < 10].shape

(23, 8)

In [41]:
purchase_data['Age'] = purchase_data['Age'].astype(float)

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [142]:
purchase_data['range'] = pd.cut(purchase_data.Age, [0,9,14,19,24,29,34,39], include_lowest=False)

grouped_by_bin = purchase_data.groupby('range').agg({'Price':['sum', 'mean','count']}).reset_index()

grouped_by_bin

      range    Price
                 sum      mean count
0    (0, 9]    77.13  3.353478    23
1   (9, 14]    82.78  2.956429    28
2  (14, 19]   412.89  3.035956   136
3  (19, 24]  1114.06  3.052219   365
4  (24, 29]   293.00  2.900990   101
5  (29, 34]   214.00  2.931507    73
6  (34, 39]   147.67  3.601707    41

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [111]:
# print(purchase_data.head())

# mean_purchase_by_user = purchase_data.groupby(['SN'])['Price'].mean()
# total_purchase_by_user = purchase_data.groupby(['SN'])['Price'].sum()
# purchase_count_by_user = purchase_data.groupby(['SN'])['Price'].count()

grouped_user_stuff = purchase_data.groupby(['SN']).agg({'Price':['sum', 'mean','count']})
grouped_user_stuff.columns = ['Total Purchase Value', 'Average Purchase Price', 'Total Purchase Count']

grouped_user_stuff.sort_values('Total Purchase Value', ascending=False).head(5)

,Total Purchase Value,Average Purchase Price,Total Purchase Count
SN,,,
Lisosia93,18.96,3.792000,5
Idastidru52,15.45,3.862500,4
Chamjask73,13.83,4.610000,3
Iral74,13.62,3.405000,4
Iskadarya95,13.10,4.366667,3

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [92]:
import numpy as np

grouped_items = purchase_data.groupby(['Item ID', 'Item Name']).agg({'Price':['sum', 'count', np.unique]})


grouped_items.sort_values([('Price', 'count')], ascending=False).head(5)

                                                      Price
                                                        sum count unique
Item ID Item Name
178     Oathbreaker, Last Hope of the Breaking Storm  50.76    12   4.23
145     Fiery Glass Crusader                          41.22     9   4.58
108     Extraction, Quickblade Of Trembling Hands     31.77     9   3.53
82      Nirvana                                       44.10     9   4.90
19      Pursuit, Cudgel of Necromancy                  8.16     8   1.02

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [94]:
grouped_items.sort_values([('Price', 'sum')], ascending=False).head(5)

                                                      Price
                                                        sum count unique
Item ID Item Name
178     Oathbreaker, Last Hope of the Breaking Storm  50.76    12   4.23
82      Nirvana                                       44.10     9   4.90
145     Fiery Glass Crusader                          41.22     9   4.58
92      Final Critic                                  39.04     8   4.88
103     Singed Scalpel                                34.80     8   4.35